---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryZTranslationSpring
source: html/eee92c12-50c3-8db6-cad8-b7f7a49fa5b4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryZTranslationSpring Property

"Z Translation - Spring"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryZTranslationSpring { get; }
```